spec/sem4r/campaign/fixtures/get-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v201101/CampaignService' -->
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="https://adwords.google.com/api/adwords/cm/v201101" xmlns:s="https://adwords.google.com/api/adwords/cm/v201101">
   <env:Header>
      <s:RequestHeader env:mustUnderstand="0">
         <authToken>***censured***</authToken>
         <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
         <developerToken>***censured***</developerToken>
      </s:RequestHeader>
   </env:Header>
   <env:Body>
      <s:get>
         <serviceSelector>
            <fields>Id</fields>
            <fields>Name</fields>
            <fields>Status</fields>
         </serviceSelector>
      </s:get>
   </env:Body>
</env:Envelope>
